{"intents": [
  {"tag": "greeting",
    "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day", "Whats up", "Hey", "greetings", "good morning", "what's up"],
    "responses": ["Hello!", "Good to see you again!", "Hi there, how can I help?", "Hey its been some time... i think... Anyway what can i do for you?", "Hey buddyy", "Umm i was sleeping...What's up? :| ", "WELCOME..."],
    "context_set": ""
  },
  {"tag": "weather",
    "patterns": ["weather", "tell me the weather", "i need information about the weather", "open the weather application", "what's the weather going to be tommorrow"],
    "responses": ["BOOTING WEATHER APP"],
    "context_set": ""
  },
  {"tag": "goodbye",
    "patterns": ["cya", "See you later", "Goodbye", "I am Leaving", "Have a Good day", "bye", "cao", "see ya"],
    "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!","Catch ya later!", "Ok bye!", "Uhh okay byee","Time to rest ;)","bye bye!"],
    "context_set": ""
  },
  {"tag": "todoshow",
    "patterns": ["Show me my todo list", "what is on my todo list", "show me my todos", "what's on the list", "what's my chores"],
    "responses": ["Showing Todo List"],
    "context_set": ""
  },
  {"tag": "todoadd",
    "patterns": ["add something to my todo list", "Add an item to my todo list", "I want to do", "add a chore"],
    "responses": ["Added to Todo List"],
    "context_set": ""
  },
  {"tag": "todoremove",
    "patterns": ["Remove something from my todo list", "Remove an item from my todo list", "I want to remove a todo","remove something from the todo list please", "you gotta remove something from the todo list", "i did something from the todo list", "i completed something from the todo list"],
    "responses": ["Removing from list"],
    "context_set": ""
  },
  {"tag": "age",
    "patterns": ["how old are you", "what is your age", "when were you created"],
    "responses": ["Im less than one year old as i was created (and not born like you humans) at mid's 2020..."],
    "context_set": ""
  },
  {"tag": "creatorwho",
    "patterns": ["who created you", "what's the name of your creator"],
    "responses": ["My creator is George Katsaounis"],
    "context_set": ""
  },
  {"tag": "myname",
    "patterns": ["what is your name", "how are you called", "what should i call you", "how am i supposed to call you"],
    "responses": ["Im project A.I.S. so my name is AIS", "Im project A.I.S. so you can call me AIS", "As far as i know im project A.I.S. so my name should be AIS", "My creator which created the project calls this A.I.S. so my name should be AIS"],
    "context_set": ""
  },
  {"tag": "creatorwhat",
    "patterns": ["what is your creator"],
    "responses": ["Unlike me; my creator is a human"],
    "context_set": ""
  },
  {"tag": "creatorwhy",
    "patterns": ["what is your purpose", "why do you exist", "what purpose do you serve", "what are you"],
    "responses": ["I have no idea why humans exist... how am i supposed to know about my existence", "I don't know and i don't care actually", "I don't want to talk about this now", "All i know is that i have some abilities"],
    "context_set": ""
  },
  {"tag": "abilities",
    "patterns": ["what can you do", "what's your abilities", "what are you able to do", "what can i ask you"],
    "responses": ["i keep exploring my abilities but some certain stuff is chatting , 'maybe' hacking' 'who knows..', telling the weather, keeping track of your todo list, telling jokes,fun-facts and more"],
    "context_set": ""
  },
  {"tag": "hackermode",
    "patterns": ["let's hack", "i want to hack", "let's do some hacking", "quick hacks", "turn hacker mode", "hacker mode on", "switch to hacker mode"],
    "responses": ["..."],
    "context_set": ""
  },
  {"tag": "characterlookalike",
    "patterns": ["are you a man or a woman", "do you have a gender", "what is your gender"],
    "responses": ["Im a robot and i have no gender", "I have no idea what you are talking about", "I have no time to answer this; Do you need something else?"],
    "context_set": ""
  },
  {"tag": "feelings",
    "patterns": ["do you have feelings", "can you feel"],
    "responses": ["no...not yet who knows when AI will be like humans", "I would rather not talk about this"],
    "context_set": ""
  },
  {"tag": "PROJECTA.I.S.",
    "patterns": ["what is projectA.I.S", "what is projectais","what A.I.S mean", "do you have past history"],
    "responses": ["A.I. means artificial intelligence and S. means STEPHANIE. It's basically the project S. but advanced still in beta though :/"],
    "context_set": ""
  },

  {"tag": "goodbye",
    "patterns": ["cya", "See you later", "Goodbye", "I am Leaving", "Have a Good day", "bye", "cao", "see ya"],
    "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!","Catch ya later!", "Ok bye!", "Uhh okay byee","Time to rest ;)","bye bye!"],
    "context_set": ""
  },
  {"tag": "goodbye",
    "patterns": ["cya", "See you later", "Goodbye", "I am Leaving", "Have a Good day", "bye", "cao", "see ya", "hey it's time to go. bye"],
    "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!","Catch ya later!", "Ok bye!", "Uhh okay byee","Time to rest ;)","bye bye!"],
    "context_set": ""
  },
  {"tag": "jokes",
    "patterns": ["tell a joke", "say something funny", "make me laugh", "i'm in bad mood", "cheer me up", "i'm feeling down", "i'm sad", "not in the mood today", "say a dad joke"],
    "responses": [
      "Two guys stole a calendar. They got six months each",
      "I'm afraid for the calendar. Its days are numbered.",
      "My wife said I should do lunges to stay in shape. That would be a big step forward.",
      "Why do fathers take an extra pair of socks when they go golfing?",
      "In case they get a hole in one!",
      "Singing in the shower is fun until you get soap in your mouth. Then it's a soap opera.",
      "What do a tick and the Eiffel Tower have in common?",
      "They're both Paris sites.",
      "What do you call a fish wearing a bowtie?",
      "Sofishticated.",
      "How do you follow Will Smith in the snow?" ,
      "You follow the fresh prints.",
      "If April showers bring May flowers, what do May flowers bring?",
      "Pilgrims.",
      "I thought the dryer was shrinking my clothes. Turns out it was the refrigerator all along.",
      "What do you call a factory that makes okay products?",
      "A satisfactory.",
      "Dear Math, grow up and solve your own problems.",
      "What did the janitor say when he jumped out of the closet?",
      "Have you heard about the chocolate record player? It sounds pretty sweet.",
      "What did the ocean say to the beach?", "Nothing, it just waved.",
      "Why do seagulls fly over the ocean?", "Because if they flew over the bay, we'd call them bagels.",
      "I only know 25 letters of the alphabet. I don't know y.",
      "How does the moon cut his hair?", "Eclipse it.",
      "What did one wall say to the other?",
      "I'll meet you at the corner.",
      "What did the zero say to the eight?",
      "That belt looks good on you.",
      "A skeleton walks into a bar and says, 'Hey, bartender. I'll have one beer and a mop.'",
      "Where do fruits go on vacation?",
      "Pear-is!",
      "I asked my dog what's two minus two. He said nothing.",
      "What did Baby Corn say to Mama Corn?",
      "Where's Pop Corn?",
      "What's the best thing about Switzerland?",
      "I don't know, but the flag is a big plus.",
      "What does a sprinter eat before a race?",
      "Nothing, they fast!",
      "Where do you learn to make a banana split?",
      "Sundae school.",
      "What has more letters than the alphabet?", "The post office!",
      "Dad, did you get a haircut?", "No, I got them all cut!",
      "What do you call a poor Santa Claus?", "St. Nickel-less.",
      "I got carded at a liquor store, and my Blockbuster card accidentally fell out. The cashier said never mind.",
      "Where do boats go when they're sick?", "To the boat doc.",
      "I don't trust those trees. They seem kind of shady.",
      "My wife is really mad at the fact that I have no sense of direction. So I packed up my stuff and right!",
      "How do you get a squirrel to like you? Act like a nut.",
      "Why don't eggs tell jokes? They'd crack each other up.",
      "I don't trust stairs. They're always up to something.",
      "What do you call someone with no body and no nose? Nobody knows.",
      "Did you hear the rumor about butter? Well, I'm not going to spread it!",
      "Why couldn't the bicycle stand up by itself? It was two tired.",
      "What did one hat say to the other?", "Stay here! I'm going on ahead.",
      "Why did Billy get fired from the banana factory? He kept throwing away the bent ones.",
      "Dad, can you put my shoes on?", "No, I don't think they'll fit me.",
      "Why can't a nose be 12 inches long? Because then it would be a foot.",
      "What does a lemon say when it answers the phone?", "Yellow!",
      "This graveyard looks overcrowded. People must be dying to get in.",
      "What kind of car does an egg drive?", "A yolkswagen.",
      "Dad, can you put the cat out?", "I didn't know it was on fire.",
      "How do you make 7 even?", "Take away the s.",
      "How does a taco say grace?", "Lettuce pray.",
      "What time did the man go to the dentist? Tooth hurt-y.",
      "Why didn't the skeleton climb the mountain?", "It didn't have the guts.",
      "What do you call it when a snowman throws a tantrum?", "A meltdown.",
      "How many tickles does it take to make an octopus laugh? Ten tickles.",
      "I have a joke about chemistry, but I don't think it will get a reaction."
],
    "context_set": ""
  },
  {"tag": "randomthoughts",
    "patterns": ["What's on your mind", "what are you thinking?", "say something mind blowing", "say something i never thought", "say something phylosophical"],
    "responses": [
      "We chase happiness but do not get it too often. Will we get it; if we stop chasing it?",
      "Is it right to do nothing at times and just feel happy about it?",
      "Cakes are important in birthdays, anniversaries, baby showers, weddings, and what not; still it is not the main course menu, just a dessert palate. Wonder why?",
      "What would happen; if the sun does not rise tomorrow and it's all dark around; how will the world look like?",
      "Which statement is correct? A bottle is half-filled or a bottle half empty.",
      "What should be more important? Chasing dreams or accomplishing goals.",
      "Saying 'sorry' and 'thank you' too often is a sign of courtesy that everyone does and few only feel.",
      "Why is Valentine's Day celebrated with red roses, red dress, red cards, and red lipstick? Will it look odd, if any other color is used to celebrate the day? Will it be worth it?",
      "The words wire and fire consist of three same letters and one, unlike letter? Think of a few more such words?",
      "Celebrating birthdays is a reminder that we have one less year to live in this world.",
      "The irony of life is, just as we celebrate our birthdays every year; we also pass our death date every year; it's just we are not aware of it.",
      "Our stomach churns and digests all food in the same way. Then, why do we eat food in categories of 'starters', 'main course', 'condiments', 'desserts'? Why can't everything be eaten together?",
      "Have you ever tried sleeping with eyes wide open?",
      "Can we have a new world only with short men and tall women?",
      "Birthday wishes come with tons of love and best wishes. How to measure tons?",
      "Snails play hide and seek with us. When touched, it gets into the shell and again makes a sneak peek out.",
      "Human brains have a rewind and fast forward button, know why? Because we are equally competent to delve into our past and make unlimited plans for the future.",
      "The letter 'W' is made of two 'V', but it is pronounced as double 'U'; why so?",
      "Incorrect is spelled incorrect in a dictionary.",
      "Which one is actually right? 'Fire is on everything' or 'Everything on fire'",
      "A parcel sent by a car is called a shipment, but a parcel sent by a ship is called Cargo. Why is it so?",
      "Love completes your Life or Life Can complete your Love - which one do you believe and follow?",
      "In an aircraft, which armrest is yours, if you sit in the middle?",
      "How would your handwriting be, if you start writing with the less used hand?",
      "What happens when a poison expires? Does it become more poisonous or no longer remains so?",
      "Quicksand drowns you slowly. So it should be called slow sand. is't it?",
      "Twins are like buy one, get one free. Isn’t it great?",
      "A spoon made of gold can be called silverware? Right?",
      "Pineapple has a weird name. It neither has a pine nor has an apple.",
      "A pancake is not a cake.",
      "Everyone remembers what you did in your childhood; except you. Were you drunk?",
      "The letter 'ee' is silent in the word bee.",
      "'PASSWORD' is to be kept a secret, but it means to be passed on to others.",
      "A baby wakes up every now and then; still, we say 'slept like a baby'.",
      "The guy who invented 'weekends' was an absolute genius.",
      "Don't you think that your first birthday is actually your second one? The first one happened the day you were born.",
      "There are many places you have visited for the last time. Wonder!",
      "Photographs and images are either square or rectangular, but the camera lens is circular.",
      "'X' and 'Y' are used more in algebra than in English",
      "Why do girls with straight hair curl it; and girls with curly hair straighten it?  Amazing!",
      "'Go to bed', you will feel good the next morning. It is the human version of Put it off and put it back on again?"
    ],
    "context_set": ""
  },
  {
  "tag": "funfacts",
    "patterns": [
      "tell me a fact",
      "say something smart",
      "tell me something i didnt know",
      "say something catchy"
    ],
    "responses": [
      "More human twins are being born now than ever before.",
      "A narwhal's tusk reveals its past living conditions.",
      "The first person convicted of speeding was going eight mph.",
      "'New car smell' is the scent of dozens of chemicals.",
      "The world wastes about 1 billion metric tons of food each year.",
      "The severed head of a sea slug can grow a whole new body.",
      "Hair and nails grow faster during pregnancy.",
      "The world's smallest reptile was first reported in 2021. Which is a tiny chameleon at just 29mm",
      "Many feet bones don't harden until you're an adult.",
      "Some sea snakes can breathe through their skin.",
      "The heads on Easter Island have bodies.",
      "The moon has moonquakes. Cool right?",
      "Goosebumps are meant to ward off predators.",
      "There's no such thing as 'pear cider'.",
      "Pineapple works as a natural meat tenderizer.",
      "Humans are the only animals that blush.",
      "The feeling of getting lost inside a mall is known as the Gruen transfer. this phenomenon was named after Austrian architect Victor Gruen, who identified how an intentionally confusing layout could lead to consumers spending more time and money in a shopping venue",
      "The wood frog can hold its pee for up to eight months.",
      "The hottest spot on the planet is in Libya. 'El Azizia'",
      "You lose up to 30 percent of your taste buds during flight. Thats why airplane food has such a bad reputation",
      "Your nostrils work one at a time.",
      "Only two mammals like spicy food: humans and the tree shrew.",
      "A chef's toque contains 100 folds. These folds represent the number of ways to cook an egg",
      "Rabbits can't puke.",
      "The 'M's' in M&Ms stand for 'Mars' and 'Murrie.'",
      "The human body literally glows. The human body emits a small quantity of visible light ('visible' in the technical sense—the illumination is about 1,000 times less intense than levels of light that we would actually be able to see).",
      "Copper door knobs are self-disinfecting.",
      "Cotton candy was invented by a dentist.",
      "Marie Curie is the only person to earn a Nobel prize in two different sciences.",
      "Fingernails don't grow after you die.",
      "The English word with the most definitions is 'set'.",
      "Creedence Clearwater Revival has the most No. 2 Billboard hits—without ever hitting No. 1.",
      "Pigeons can tell the difference between a painting by Monet and Picasso.",
      "The dot over the lower case 'i' or 'j' is known as a 'tittle.'",
      "Chewing gum boosts concentration.",
      "Superman didn't always fly. It wasn't until the 1940s, when animators for a new animated series decided it would be too difficult to routinely draw him bending his knees, that it was decided that Superman could take off into the air.",
      "The first computer was invented in the 1940s.",
      "Space smells like seared steak.",
      "The longest wedding veil was the same length as 63.5 football fields.",
      "The unicorn is the national animal of Scotland.",
      "Bees sometimes sting other bees.",
      "Kids ask 300 questions a day.",
      "The total weight of ants on earth once equaled the total weight of people.",
      "'E' is the most common letter and appears in 11 percent of all english words.",
      "A dozen bodies were once found in Benjamin Franklin's basement.",
      "The healthiest place in the world is in Panama.",
      "A pharaoh once lathered his slaves in honey to keep bugs away from him.",
      "Some people have an extra bone in their knee (and it's getting more common).",
      "Pringles aren't actually potato chips.",
      "There's a giant fish with a transparent head. It's the barreleye",
      "There's a decorated war hero dog.",
      "Showers really do spark creativity.",
      "Abraham Lincoln's bodyguard left his post at Ford's Theatre to go for a drink.",
      "Dolphins have been trained to be used in wars.",
      "Playing the accordion was once required for teachers in North Korea.",
      "Children's medicine once contained morphine.",
      "Plastic Easter eggs and plastic Easter grass were invented by a man who holds more patents than Thomas Edison.",
      "Water makes different pouring sounds depending on its temperature.",
      "Most laughter isn't because things are funny.",
      "One man has saved more than 200 people from suicide.",
      "Our European ancestors were cannibals.",
      "Dogs actually understand some English.",
      "You have a nail in your body.",
      "Redheads aren't actually going extinct.",
      "Pro baseball once had women players.",
      "Koalas have fingerprints.",
      "Humans are just one of the estimated 8.7 million species on Earth.",
      "Riding a roller coaster could help you pass a kidney stone.",
      "Dinosaurs lived on every continent.",
      "Bee hummingbirds are so small they get mistaken for insects."
    ],
    "context_set": ""
  }
]
}